import React from 'react';

const Question = () => {
    return (
        <div>
            <h2 className='text-2xl'>
                question One: <br />
                <small>
                    আমরা রিঅ্যাক্ট এ সাধারণত একটা কম্পোনেন্ট থেকে আরেকটা কম্পোনেন্ট এ ডাটা সেন্ড করি। সেক্ষেত্রে একটা কম্পোনেন্ট এর ডাটা আরেকটা চাইল্ড কম্পোনেন্ট এ প্রপস হিসাবে পাঠাতে হয়। অনেকসময় এরকম সিচুয়েশন আসে যে আমাদের মেইন কম্পোনেন্ট যেখানে আপনার ডাটা রয়েছে সেখান থেকে চাইল্ড কম্পোনেন্ট অনেক লেভেল নিচে থাকে। মানে ঐ ডাটাওয়ালা কম্পোনেন্ট এর আরেকটা চাইল্ড কম্পোনেন্ট আছে, আবার সেই চাইল্ড কম্পোনেন্ট এর আবার আরেকটা চাইল্ড কম্পোনেন্ট আছে। এভাবে করতে করতে অনেকগুলা চাইল্ড থাকতে পারে। এখন আমরা মেইন কম্পোনেন্ট বা আমরা যেটাকে বলি টপ লেভেল কম্পোনেন্ট থেকে ডাটা অনেক লেভেল নিচের কোনো চাইল্ড কম্পোনেন্ট এ নিতে চাই, তাহলে আমাদের সেই চাইল্ড কম্পোনেন্ট এর প্যারেন্ট এবং সেই প্যারেন্ট এর প্যারেন্ট এভাবে করতে করতে ডাটাওয়ালা কম্পোনেন্ট এ বা টপ লেভেল কম্পোনেন্ট পর্যন্ত সবগুলার হেল্প নিতে হবে ডাটা পাস করার জন্যে। এটাকে খুড়তে খুড়তে ডাটা নেওয়ার মতো বলা যায়। এরকম সিচুয়েশনে আমরা রিডাক্স ইউজ করি সাধারণত। বা সিচুয়েশান এর চেয়েও জটিল হতে পারে। সেক্ষেত্রে আমরা এরকম গ্লোবাল স্ট্যাট রাখি যেটা পরে যেকোনো চাইল্ডই চাইলে অ্যাক্সেস করতে পারে, খুড়ে খুড়ে সব কম্পোনেন্ট এ প্রপস হিসাবে পাস করে ডাটা নিতে হয় না।
                </small>
            </h2>
        </div>
    );
};

export default Question;